espressif/esp-idf/components/soc/esp32s3/include/soc/usbh_struct.h
typedef union {
    struct {
        uint32_t xfersize0: 7;
        uint32_t reserved12: 12;
        uint32_t pktcnt0: 2;
        uint32_t reserved11: 11;
    };
    uint32_t val;
} usb_dieptsiz0_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr0;
    };
    uint32_t val;
} usb_diepdma0_reg_t;

typedef union {
    struct {
        uint32_t ineptxfspcavail0: 16;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_dtxfsts0_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr0;
    };
    uint32_t val;
} usb_diepdmab0_reg_t;

typedef union {
    struct {
        uint32_t mps: 2;
        uint32_t reserved9: 9;
        uint32_t reserved4: 4;
        uint32_t usbactep: 1;
        uint32_t reserved1a: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t reserved1b: 1;
        uint32_t stall: 1;
        uint32_t txfnum: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t setd0pid: 1;
        uint32_t setd1pid: 1;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_diepctl_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t timeout: 1;
        uint32_t intkntxfemp: 1;
        uint32_t intknepmis: 1;
        uint32_t inepnakeff: 1;
        uint32_t txfemp: 1;
        uint32_t txfifoundrn: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved1: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyetintrpt: 1;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_diepint_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 7;
        uint32_t reserved12: 12;
        uint32_t pktcnt: 2;
        uint32_t reserved11: 11;
    };
    uint32_t val;
} usb_dieptsiz_reg_t;

typedef union {
    struct {
        uint32_t dmaddr1;
    };
    uint32_t val;
} usb_diepdma_reg_t;

typedef union {
    struct {
        uint32_t ineptxfspcavail: 16;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_dtxfsts_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr1;
    };
    uint32_t val;
} usb_diepdmab_reg_t;

typedef union {
    struct {
        uint32_t mps0: 2;
        uint32_t reserved13: 13;
        uint32_t usbactep0: 1;
        uint32_t reserved1: 1;
        uint32_t naksts0: 1;
        uint32_t eptype0: 2;
        uint32_t snp0: 1;
        uint32_t stall0: 1;
        uint32_t reserved4: 4;
        uint32_t cnak0: 1;
        uint32_t snak0: 1;
        uint32_t reserved2: 2;
        uint32_t epdis0: 1;
        uint32_t epena0: 1;
    };
    uint32_t val;
} usb_doepctl0_reg_t;

typedef union {
    struct {
        uint32_t xfercompl0: 1;
        uint32_t epdisbld0: 1;
        uint32_t ahberr0: 1;
        uint32_t setup0: 1;
        uint32_t outtknepdis0: 1;
        uint32_t stsphsercvd0: 1;
        uint32_t back2backsetup0: 1;
        uint32_t reserved1a: 1;
        uint32_t outpkterr0: 1;
        uint32_t bnaintr0: 1;
        uint32_t reserved1b: 1;
        uint32_t pktdrpsts0: 1;
        uint32_t bbleerr0: 1;
        uint32_t nakintrpt0: 1;
        uint32_t nyepintrpt0: 1;
        uint32_t stuppktrcvd0: 1;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_doepint0_reg_t;

typedef union {
    struct {
        uint32_t xfersize0: 7;
        uint32_t reserved12: 12;
        uint32_t pktcnt0: 1;
        uint32_t reserved9: 9;
        uint32_t supcnt0: 2;
        uint32_t reserved1: 1;
    };
    uint32_t val;
} usb_doeptsiz0_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr0;
    };
    uint32_t val;
} usb_doepdma0_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr0;
    };
    uint32_t val;
} usb_doepdmab0_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t reserved4a: 4;
        uint32_t usbactep: 1;
        uint32_t reserved1: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t snp: 1;
        uint32_t stall: 1;
        uint32_t reserved4b: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t setd0pid: 1;
        uint32_t setd1pid: 1;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_doepctl_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t setup: 1;
        uint32_t outtknepdis: 1;
        uint32_t stsphsercvd: 1;
        uint32_t back2backsetup: 1;
        uint32_t reserved1a: 1;
        uint32_t outpkterr: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved1b: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyepintrpt: 1;
        uint32_t stuppktrcvd: 1;
        uint32_t reserved16: 16;
    };
    uint32_t val;
} usb_doepint_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 7;
        uint32_t reserved12: 12;
        uint32_t pktcnt: 1;
        uint32_t reserved9: 9;
        uint32_t supcnt: 2;
        uint32_t reserved1: 1;
    };
    uint32_t val;
} usb_doeptsiz_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr;
    };
    uint32_t val;
} usb_doepdma_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_doepdmab_reg_t;

typedef union {
    struct {
        uint32_t stoppclk: 1;
        uint32_t gatehclk: 1;
        uint32_t pwrclmp: 1;
        uint32_t rstpdwnmodule: 1;
        uint32_t reserved2: 2;
        uint32_t physleep: 1;
        uint32_t l1suspended: 1;
        uint32_t resetaftersusp: 1;
        uint32_t reserved23: 23;
    };
    uint32_t val;
} usb_pcgcctl_reg_t;

/* --------------------------- Register Groups ------------------------------ */

typedef struct {
    volatile usb_hcchar_reg_t hcchar_reg;    //0x00
    uint32_t reserved_0x04_0x08[1]; //0x04
    volatile usb_hcint_reg_t hcint_reg;      //0x08
    volatile usb_hcintmsk_reg_t hcintmsk_reg;    //0x0c
    volatile usb_hctsiz_reg_t hctsiz_reg;    //0x10
    volatile usb_hcdma_reg_t hcdma_reg;      //0x14
    uint32_t reserved_0x14_0x14[1]; //0x18*
    volatile usb_hcdmab_reg_t hcdmab_reg;    //0x1c
} usb_host_chan_regs_t;

